toko_KrisostomosAbdi_A11.2019.11695/app/Controllers/Home.php

    public function index()
    {
        $DiskonModel = new \App\Models\DiskonModel();
        return view('home', [
            'diskon' => $DiskonModel->where('Aktif', 1)->findAll(),
        ]);
---
SELECT *
FROM `diskon`
WHERE `Aktif` = 1