toko_KrisostomosAbdi_A11.2019.11695/app/Controllers/Shop.php

    public function index()
    {
        $barang = $this->barang->select('barang.*, kategori.nama AS kategori')->join('kategori', 'barang.id_kategori=kategori.id')->findAll();
        $kategori = $this->kategori->findAll();
---
SELECT `barang`.*, `kategori`.`nama` AS `kategori`
FROM `barang`
JOIN `kategori` ON `barang`.`id_kategori`=`kategori`.`id`
SELECT *
FROM `kategori`

    public function product()
    {
        $id = $this->request->uri->getSegment(3);

        $barang = $this->barang->find($id);
        $kategori = $this->kategori->findAll();
        $komentar = $this->komentar->select('komentar.*, user.username')->where('id_barang', $id)->join('user', 'komentar.id_user=user.id')->findAll();
---
SELECT *
FROM `barang`
WHERE `barang`.`id` = '1'
SELECT *
FROM `kategori`
SELECT `komentar`.*, `user`.`username`
FROM `komentar`
JOIN `user` ON `komentar`.`id_user`=`user`.`id`
WHERE `id_barang` = '1'

    public function getVoucher()
    {
        if ($this->request->isAJAX()) {
            $kode = $this->request->getGet('kode');
            $tanggal = date('Y-m-d');
            $db = $this->diskon->where('Kode_voucher', $kode)->findAll();
            if ($db == NULL) {
                $data = [];
            } else {
                foreach ($db as $s) {
                    $awal = $s->Tanggal_mulai_berlaku;
                    $akhir = $s->Tanggal_akhir_berlaku;
                }
                if ($tanggal > $akhir || $tanggal < $awal) {
                    $data = [];
                } else {
                    $data = $this->diskon->where('Kode_voucher', $kode)->where('Aktif', 1)->findAll();
---
SELECT *
FROM `diskon`
WHERE `Kode_voucher` = 'NEWYEAR23'
SELECT *
FROM `diskon`
WHERE `Kode_voucher` = 'NEWYEAR23'
AND `Aktif` = 1